[
  {
    "title": "Pink and ochre - a blogging app",
    "description":"pink and ochre is one of the side project with my friend who is seo specialist and i handle all the developmemt of it. it has best of best animations without any library and without any framework. i also like to make my own stuff so all the blogs are aaved in json tried for fastest lookup and in a React.createelement way. i also want to make an tool to help me make json from ui kind of like wix.com. do visit its homepage and check it out.",
    "image": "/IMG_1531.JPG",
    "link": "https://pinkandochre.com",
    "github": ""
  },
  {
    "title": "Todo Application with CRUD and Authentication - Autorization",
    "description": "It's an simple Next js Todo task application with CRUD OPERATION TO Create Read Update or delete tasks. It also has login and signup and Authorization with jwt Token and brcyptjs.",
    "image": "/todo.JPG",
    "link": "https://next-todo-lime-theta.vercel.app/",
    "github": "https://github.com/Harsh244007/Next-todo"
  },
  {

    "title": "Rich Text Drafer in React",
    "description": "It is an Rich Text drafter in React. It has custom shortcuts to Make Text Bold, Heading and show code in Text Editor.",
    "image": "/todo.JPG",
    "link": "https://react-text-deafter-draft-js.vercel.app/",
    "github": "https://github.com/Harsh244007/React-text-deafter-draft-js"
  },
  {
    "title": "Survey Dashboard with query Pagination.",
    "description": "It's an dashboard to display surveys based on query limits and filters. Most of the functionality is achieved by making custom hooks for fetching filtering based on filters and searching.",
    "image": "/comment.JPG",
    "link": "https://cleverx-dashboard-assignment.vercel.app/",
    "github": "https://github.com/Harsh244007/cleverx-dashboard-assignment"
  },
  {
    "title": "3D Island with all weather.",
    "description": "I love to explore new tech so here's my try on three js . An world of island with birds sky and everything inspired frm js mastery. Built on Next js and typescript with glb files for modal.",
    "image": "/comment.JPG",
    "link": "https://next-three-js-island.vercel.app/",
    "github": "https://github.com/Harsh244007/next-three-js-island"
  },
  {
    "title": "Recursive Comment Section.",
    "description": "Explore an engaging and intuitive comment section built with Preact, TypeScript, and Tailwind CSS. Dive into a seamless experience of nested comments, replies, and discussions. Discover the power of interactive web development in this feature-rich example. Join the conversation and make your voice heard!",
    "image": "/comment.JPG",
    "link": "https://recursive-nested-comments.vercel.app/",
    "github": "https://github.com/Harsh244007/Recursive-nested-comments"
  },
  {
    "title": "Ecommerce App with discount on individual items from backend.",
    "description": "I've developed an eCommerce app using Next.js, fetching data from Node.js with a 5-item limit per page. Each item comes with its unique discount coupon for user application. I have used tailwind and typescript with next js and mongoose.",
    "image": "/ecom.gif",
    "link": "https://e-com-store-next-typescript.vercel.app/",
    "github": "https://github.com/Harsh244007/e-com-store-next-typescript"
  },
  {
    "title": "University Dean Student CRUD and session booking app.",
    "description": "I've built a Node.js-based university session API that enables students to schedule one-on-one sessions with deans. It incorporates secure user authentication through JWT and password hashing via bcrypt. The system maintains a strict one-student-to-one-dean ratio for each session, ensuring personalized and efficient interactions between students and deans.",
    "image": "",
    "link": "",
    "github": "https://github.com/Harsh244007/dean-student-backend"
  },
  {
    "title": "A really cool chatbot in react with custom inputs for student info.",
    "description": "I've crafted a chatbot using React, Redux, TypeScript, and Tailwind CSS, featuring a customized input system that appears as needed, enhancing user interactions for a dynamic and engaging experience.",
    "image": "/chatbot.gif",
    "link": "https://chat-bot-react-redux-ts.vercel.app/",
    "github": "https://github.com/Harsh244007/chat-bot-react-redux-ts"
  },
  {
    "title": "JAVA SpringBoot weather app.",
    "description": "I've developed a highly optimized Java Spring Boot application backed by PostgreSQL for a weather app. It efficiently fetches weather data for every city, ensuring real-time updates and accurate information at users' fingertips..",
    "image": "",
    "link": "",
    "github": "https://github.com/Harsh244007/spring-hibernate-postgres-weather-app"
  },
  {
    "title": "Text to Speech with Speech Synthesis web api.",
    "description": "I've developed a web application that utilizes the Speech Synthesis Web API, offering users multiple customizable settings. This app converts text into speech, allowing users to adjust parameters such as pitch, rate, and voice selection for a personalized and versatile text-to-speech experience.",
    "image": "/speech.JPG",
    "link": "https://speech-synthesis-app-demo.vercel.app/",
    "github": "https://github.com/Harsh244007/speech-synthesis-app-demo"
  },
  {
    "title": "Apperture Gear Studios ",
    "description": "Apperture Gear Studios is built on Next JS for their photography business. This platform consolidates all their clients' needs, providing a centralized hub for their event images and videos.",
    "image": "/apperture.jpeg",
    "github": "",
    "link": "https://www.aperturegearstudio.com/"
  }
]
